{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "%load_ext dotenv\n",
    "%dotenv\n",
    "import os\n",
    "from neo4j import GraphDatabase\n",
    "\n",
    "\n",
    "AUTH = (os.getenv(\"NEO4J_USER\"), os.getenv(\"NEO4J_PASSWORD\"))\n",
    "\n",
    "with GraphDatabase.driver(os.getenv(\"NEO4J_URL\"), auth=(AUTH)) as driver:\n",
    "    driver.verify_connectivity()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<module 'openai_assistant' from '/Users/oskarhane/Development/tmp/neo4j-genai-design/openai_assistant.py'>"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from importlib import reload\n",
    "import openai_assistant\n",
    "\n",
    "reload(openai_assistant)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [],
   "source": [
    "from custom_retrievers import movie\n",
    "import retriever_router\n",
    "import neo4j_retrievers\n",
    "import neo4j_rag\n",
    "import builtin_retrievers\n",
    "reload(neo4j_retrievers)\n",
    "reload(builtin_retrievers)\n",
    "reload(movie)\n",
    "reload(retriever_router)\n",
    "reload(neo4j_rag)\n",
    "\n",
    "llm = openai_assistant.OpenAIAssitant()\n",
    "\n",
    "movie_plot_similarity = neo4j_retrievers.VectorRetriever(\n",
    "    driver=driver,\n",
    "    llm=llm, \n",
    "    name=\"movie_plot_similarity\",\n",
    "    index_name=\"moviePlotsEmbedding\"\n",
    ")\n",
    "text2cypher_retriever = neo4j_retrievers.Text2Cypher(driver=driver, llm=llm)\n",
    "movie_retriever = movie.MovieRetriever(driver=driver)\n",
    "\n",
    "agentic_retriever = retriever_router.RetrieverRouter(\n",
    "    llm=llm, \n",
    "    retrievers=[movie_plot_similarity, movie_retriever, text2cypher_retriever]\n",
    ")\n",
    "\n",
    "rag_app = neo4j_rag.Neo4jRAG(llm=llm, retriever=agentic_retriever)\n",
    "# or\n",
    "single_retriever_rag_app = neo4j_rag.Neo4jRAG(llm=llm, retriever=text2cypher_retriever)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "------ Agentic retriever ------\n",
      "Expanded questions: [\"What year was the movie 'Casino' released?\"]\n",
      "Updated question: In what year was the movie 'Casino' released?\n",
      "MovieRetriever invoked: 'Casino' 'exact'\n",
      "Response from tools: ['[{\"movie\": {\"title\": \"Casino\", \"year\": 1995, \"plot\": \"Greed, deception, money, power, and murder occur between two mobster best friends and a trophy wife over a gambling empire.\"}, \"actors\": [{\"name\": \"Robert De Niro\", \"role\": \"Sam \\'Ace\\' Rothstein\"}, {\"name\": \"Joe Pesci\", \"role\": \"Nicky Santoro\"}, {\"name\": \"Sharon Stone\", \"role\": \"Ginger McKenna\"}, {\"name\": \"James Woods\", \"role\": \"Lester Diamond\"}]}]']\n",
      "Unanswered questions: []\n",
      "--- output ---\n",
      "The movie \"Casino\" was released in 1995.\n",
      "------ Single retriever ------\n",
      "Text2Cypher invoked: What year was the movie \"Casino\" released?\n",
      "MATCH (m:Movie {title: \"Casino\"}) RETURN m.year\n",
      "[<Record m.year=1995>]\n",
      "--- output ---\n",
      "The movie \"Casino\" was released in 1995.\n"
     ]
    }
   ],
   "source": [
    "print(\"------ Agentic retriever ------\")\n",
    "response = rag_app.handle_input('What year was the movie \"Casino\" released?')\n",
    "print(\"--- output ---\")\n",
    "print(response)\n",
    "\n",
    "print(\"------ Single retriever ------\")\n",
    "response = single_retriever_rag_app.handle_input('What year was the movie \"Casino\" released?')\n",
    "print(\"--- output ---\")\n",
    "print(response)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "------ Agentic retriever ------\n",
      "Expanded questions: [\"What movie is about 'two mobster best friends and a trophy wife'?\", \"What year was the movie about 'two mobster best friends and a trophy wife' released?\", \"Who were some actors playing roles in the movie about 'two mobster best friends and a trophy wife'?\"]\n",
      "Routing question: What movie is about 'two mobster best friends and a trophy wife'?\n",
      "Output: []\n",
      "Updated question: What movie is about two mobster best friends and a trophy wife?\n",
      "VectorRetriever invoked: two mobster best friends and a trophy wife\n",
      "[-0.013337071053683758, -0.012353296391665936, 0.016347816213965416, -0.02626478485763073, -0.01087433472275734, 0.022791864350438118, 0.007474041543900967, 0.0006779952673241496, -0.0055130962282419205, -0.056992869824171066, 0.011554392985999584, -0.004067146219313145, 0.014050141908228397, 0.009038836695253849, 0.010418761521577835, -0.007480644155293703, 0.026027094572782516, -0.010121648199856281, 0.011263882741332054, -0.031322307884693146, -0.00044030489516444504, 0.013918091543018818, -0.02174866944551468, -0.017694726586341858, 0.0016233922215178609, -0.012201438657939434, 0.013984116725623608, -5.900993346585892e-05, 0.0006218739436008036, 0.008015447296202183, 0.010174468159675598, -0.00031547617982141674, 0.004677878692746162, -0.008411598391830921, -0.017258962616324425, -0.02703067660331726, -0.009652869775891304, 0.0015813012141734362, -0.0009507614886388183, 0.02038855105638504, -0.0018222928047180176, -0.025010308250784874, 0.0017529664328321815, -0.02812669426202774, -0.025842225179076195, -0.02168264426290989, -0.00099202711135149, -0.006685041822493076, -0.02865489386022091, -0.003859167220070958, 0.00799563992768526, 0.016149740666151047, -0.002302625449374318, -0.014802827499806881, 0.0032187236938625574, 0.005836619064211845, -0.0056682550348341465, 0.016796786338090897, -0.010438568890094757, -0.003519137855619192, -0.011627020314335823, -0.018737923353910446, -0.02947360649704933, 0.002312529133632779, 0.00647045997902751, -0.0005529602058231831, -0.005456974729895592, 0.01599127985537052, -0.01144875306636095, -0.004261920228600502, 0.043074775487184525, 0.02180148847401142, -0.01691563054919243, -0.004615154583007097, 0.0038063470274209976, -0.04101479426026344, -0.017311781644821167, -0.008055062033236027, 0.005876234266906977, -0.0016002834308892488, 0.02883976511657238, -0.011178050190210342, -0.008603070862591267, 0.016730761155486107, 0.022488148882985115, 0.01090074423700571, -0.015898844227194786, 0.013416300527751446, -0.0009392070933245122, 0.012987137772142887, 0.00799563992768526, 0.022725841030478477, 0.013376685790717602, 0.016928836703300476, -0.014076551422476768, 0.0183945931494236, -0.021471362560987473, 0.0300018060952425, 0.010049020871520042, -0.00247759185731411, 0.02251455932855606, -0.007606091909110546, -0.017324985936284065, -0.010643246583640575, -0.02581581473350525, -0.013271045871078968, 0.01045177411288023, -0.020797906443476677, 0.020348936319351196, 0.017179731279611588, -0.01399732194840908, 0.020982777699828148, 0.03705328702926636, -0.05189573019742966, -0.0300018060952425, -0.014816032722592354, 0.020362140610814095, -0.01980753056704998, 0.006510075181722641, -0.008933196775615215, -0.008556853048503399, 0.020547011867165565, 0.022052384912967682, -0.008570058271288872, 0.009738702327013016, -0.0013691955246031284, -0.0021837803069502115, -0.021959949284791946, 0.008319162763655186, 0.016559096053242683, 0.06306717544794083, 0.006156840827316046, 0.012445732019841671, 0.004767012316733599, -0.024297237396240234, -4.443798752618022e-05, -0.02457454241812229, -0.015978075563907623, -0.014974493533372879, -0.01904163882136345, 0.0020698870066553354, 0.028311563655734062, -0.003971409983932972, -0.009302936494350433, 0.00534143066033721, 0.00812769029289484, 0.01235989946871996, 0.004169485066086054, 0.00890018418431282, -0.015515899285674095, 0.009342552162706852, -0.021009188145399094, 0.011422342620790005, 0.0026244977489113808, 0.008893581107258797, 0.012122209183871746, -0.010009405203163624, -0.0025436170399188995, 0.0013502133078873158, -0.009897163137793541, -0.009118066169321537, 0.014155781827867031, 0.004011025186628103, -0.0067015476524829865, 0.014235012233257294, 0.037977639585733414, 0.014855648390948772, 0.02149777300655842, 0.008603070862591267, -0.01638743095099926, 0.009738702327013016, 0.0002634814300108701, -0.012841882184147835, 0.014987697824835777, 0.0029034537728875875, 0.016017690300941467, 0.02025650069117546, 0.01506692823022604, -0.010537606664001942, -0.00819371547549963, 0.007262761238962412, 0.015463079325854778, 0.018764333799481392, 0.021022392436861992, -0.0003631380677688867, 0.011125229299068451, -0.025314023718237877, -0.014538727700710297, 0.008873773738741875, 0.0013568158028647304, 0.0009524120832793415, 0.03694764897227287, 0.01982073485851288, -0.002007163129746914, -0.6638427972793579, -0.0009359058458358049, -0.013020150363445282, -0.024891464039683342, 0.014036936685442924, 0.011976953595876694, -0.0004085303226020187, -0.007427824195474386, -0.011045999825000763, 0.01580640859901905, -0.009005824103951454, 0.006727958098053932, 0.010088635608553886, -0.006269083358347416, -0.034861255437135696, -0.014327446930110455, -0.0010935408063232899, -0.02354455180466175, -0.021775078028440475, 0.027915412560105324, -0.01987355574965477, 0.011138434521853924, 0.015093338675796986, -0.0049881963059306145, 0.015172568149864674, -0.013502133078873158, 0.01187131367623806, -0.03475561365485191, -0.005747484974563122, 0.02258058451116085, -0.04040736332535744, 0.031322307884693146, -0.0067873806692659855, -0.004526020959019661, 0.050628047436475754, -0.01519897859543562, -0.01761549711227417, 0.0335671603679657, -0.007223146036267281, 0.01422180701047182, -0.01393129676580429, -0.016493070870637894, -0.005077330395579338, 0.014525522477924824, -0.0023158304393291473, 0.0029067550785839558, 0.01890958845615387, -0.006589305121451616, 0.004219003953039646, -0.008636083453893661, 0.00672465655952692, 0.01167323812842369, -0.017972033470869064, -0.014023731462657452, 0.0009515867568552494, -0.0001919886126415804, 0.02749285288155079, 0.003383786417543888, -0.011494969949126244, -0.003136192448437214, -0.007302376441657543, -0.006140334531664848, -0.010280108079314232, -0.0029051045421510935, -0.0010531003354117274, 0.02923591434955597, -0.022276869043707848, 0.01780036836862564, 0.005021208897233009, -0.014816032722592354, 0.0009243514505214989, 0.012623999267816544, -0.00832576584070921, 0.0030305522959679365, 0.014102961868047714, 0.04975651577115059, 0.022171229124069214, 0.0043939705938100815, 0.0011001433013007045, -0.004483104217797518, -0.004331246484071016, -0.012003363110125065, -0.04220324382185936, -0.018935998901724815, 0.01593845896422863, -0.008537045679986477, -0.040222492069005966, 0.05535544455051422, 0.00480662751942873, -0.004337849095463753, 0.02258058451116085, -0.001015135901980102, -0.017060887068510056, 0.029077455401420593, 0.010834719054400921, 0.010075430385768414, -0.011026192456483841, 0.006972250994294882, 0.0014393472811207175, -0.048171915113925934, 0.0018718116916716099, -0.02703067660331726, 0.023003146052360535, 0.0029975397046655416, -0.0012553022243082523, 0.014697187580168247, 0.00277470494620502, 0.017985237762331963, 0.02522158809006214, -0.018038058653473854, 0.009362359531223774, 0.005836619064211845, 0.002763150492683053, -0.020230092108249664, -0.034359462559223175, -0.03251076117157936, -0.008253137581050396, 0.011204459704458714, 0.018143698573112488, -0.01607050932943821, 0.019649069756269455, -0.00288694747723639, 0.03586483374238014, -0.004700987134128809, -0.002428073203191161, 0.021075213328003883, 0.016994861885905266, -0.021062007173895836, -0.021392133086919785, 0.007269363850355148, 0.011283690109848976, 0.017074091359972954, 0.022408919408917427, -0.020164066925644875, 0.01909445971250534, -0.007573079317808151, 0.0037403220776468515, -0.017192937433719635, 0.03412177413702011, -0.01315880287438631, 0.002990937093272805, -0.0025007007643580437, 0.009250116534531116, -0.006440748926252127, 0.0020055125933140516, -0.029315145686268806, -0.013944501988589764, 0.0063582174479961395, -0.028602074831724167, -0.013720015995204449, 0.015859229490160942, 0.005027811508625746, 0.0008100454579107463, 0.0037535270676016808, 0.02722875215113163, -0.005991777870804071, -0.029790526255965233, 0.003545548068359494, -0.02019047550857067, -0.008966208435595036, -0.009236912243068218, -0.010788501240313053, -0.02296353131532669, 0.012524961493909359, 0.007744744420051575, -0.007223146036267281, 0.01457834243774414, 0.007229748647660017, 0.0008372808224521577, -0.024627363309264183, 0.0020616338588297367, -0.01548948884010315, -0.0300018060952425, 0.007038275711238384, -0.01889638416469097, 0.007170326076447964, 0.0018024853197857738, 0.013574761338531971, 0.012828676961362362, 0.003509234171360731, -0.015793204307556152, -0.011409137398004532, -0.025406459346413612, -0.0028968513943254948, 0.020348936319351196, -0.003552150446921587, 0.013337071053683758, 0.008121087215840816, -1.6828664229251444e-05, 0.011244074441492558, -0.030556418001651764, 0.04085633158683777, 0.00036561398883350194, -0.0009375564404763281, 0.011851505376398563, 0.0046448661014437675, 0.017958827316761017, 0.025446074083447456, -0.0017017970094457269, 0.014948083087801933, 0.03884917125105858, -0.0035917656496167183, 0.019054844975471497, -0.005985175725072622, 0.00664872769266367, -0.023861471563577652, 0.007982434704899788, -0.028047462925314903, 0.016862811520695686, 0.012260861694812775, 0.016413839533925056, -0.025538509711623192, -0.00897281151264906, -0.008272944949567318, 0.035389453172683716, 0.03443869203329086, -0.011461957357823849, 0.016955247148871422, -0.010636643506586552, -0.0016184402629733086, 0.008893581107258797, 0.004856146406382322, 0.003667694516479969, 0.011943941004574299, 0.03266922011971474, -0.0028572361916303635, 0.012340091168880463, 0.009157681837677956, 0.005414058454334736, -0.01574038341641426, -0.015951665118336678, 0.003575259353965521, 0.02148456871509552, 0.0006755193462595344, -0.003809648333117366, -0.03940378129482269, 0.008966208435595036, -0.01493487786501646, 0.02844361402094364, -0.026660935953259468, -0.018935998901724815, 0.016413839533925056, 0.025261204689741135, -0.023848267272114754, 0.010768693871796131, -0.002424771897494793, 0.015304618515074253, 0.0021870816126465797, 0.004691083449870348, 0.030952567234635353, -0.03974711149930954, 0.0007724937167949975, -0.00667843921110034, 0.031269486993551254, 0.019649069756269455, -0.018156902864575386, 0.0003311571490485221, 0.008721916005015373, 0.0091972965747118, 0.0367627777159214, 0.02115444280207157, 0.0015697467606514692, 0.012795664370059967, 0.004727397114038467, 0.024178393185138702, 0.0038195522502064705, 0.0015482886228710413, 0.0014731851406395435, 0.006602510344237089, -0.013627581298351288, 0.0007118331268429756, -0.006328505929559469, -0.00611392455175519, 0.007203338667750359, 0.02057342231273651, 0.0017562677385285497, -0.015449874103069305, 0.03295972943305969, 0.007540066726505756, 0.018143698573112488, -0.012346694245934486, -0.028734125196933746, 0.027004266157746315, 0.017021270468831062, -0.012524961493909359, -0.009296334348618984, -0.006529882550239563, -0.006992058362811804, 0.008893581107258797, 0.034676384180784225, 0.022342894226312637, 0.0015392102068290114, -0.009501012042164803, 0.0031262885313481092, -0.0009400324197486043, 0.013891681097447872, 0.020309321582317352, -0.01542346365749836, 0.011818493716418743, -0.03443869203329086, 0.031718458980321884, 0.002731788670644164, -0.03245794028043747, -0.012214643880724907, 0.014142576605081558, -0.005268803332000971, 0.016308199614286423, -0.022356100380420685, -0.004512815736234188, 0.00021747018035966903, -0.003324363846331835, -0.004314740654081106, -0.006133731920272112, 0.0007654785295017064, -0.007823974825441837, -0.01457834243774414, -0.005816811695694923, -0.021392133086919785, 0.015727179124951363, -0.006272384896874428, -0.00196094554848969, -0.023570962250232697, -0.03272204101085663, -0.006727958098053932, 0.1388111710548401, 0.03153358772397041, 0.0017760752234607935, 0.01067625917494297, 0.007335389032959938, -0.019464200362563133, -0.017074091359972954, -0.021959949284791946, 0.019068049266934395, 0.0014509016182273626, 0.023399295285344124, -0.0019774518441408873, 0.0033458219841122627, 0.006833598017692566, 0.01917368918657303, -0.0012206390965729952, -0.003363979049026966, -0.010590426623821259, 0.021075213328003883, -0.01216182392090559, -0.002594786463305354, -0.00932274479418993, 0.014102961868047714, 0.0018553053960204124, -0.01486885268241167, 0.0013947802362963557, 0.021022392436861992, 0.013746426440775394, -0.007223146036267281, -0.01721934601664543, -0.014393472112715244, 0.017008066177368164, -0.00981133058667183, 0.00039470632327720523, 0.0034696192014962435, -0.024759413674473763, 0.012109003961086273, 0.018724719062447548, 0.034993305802345276, 0.013574761338531971, 0.012465539388358593, -0.007275966461747885, 0.008609673008322716, 0.002832476980984211, 0.020494190976023674, -0.0042784265242516994, -0.0034366066101938486, 0.002606340916827321, 0.020758291706442833, 0.010511196218430996, 0.042678624391555786, 0.023016350343823433, 0.031190257519483566, -0.014816032722592354, 0.0075268615037202835, -0.018302157521247864, -0.020441371947526932, -0.015727179124951363, -0.00448640575632453, 0.03200896829366684, 0.005470179487019777, -0.015832819044589996, 0.019279329106211662, -0.007982434704899788, 0.009725497104227543, -0.026079915463924408, -0.03393690288066864, -0.013535145670175552, -0.000959014636464417, -0.02497069351375103, 0.011422342620790005, 0.006774175446480513, -0.0006404434680007398, -0.004410476889461279, 0.023135196417570114, 0.011825095862150192, 0.016823196783661842, -0.009606651961803436, -0.0013923043152317405, 0.025459280237555504, -0.02412557229399681, -0.005971970502287149, -0.018209723755717278, -0.02199956402182579, -0.025115948170423508, 0.0023191317450255156, -0.009877354837954044, -0.024402877315878868, -0.027598492801189423, -0.01174586545675993, 0.02470659278333187, 0.006556292530149221, 0.00825974065810442, -0.005995079409331083, -0.0016753869131207466, -0.005087234079837799, 0.008253137581050396, -0.002502351300790906, -0.004364259075373411, 0.031322307884693146, 0.006985455751419067, -0.022567380219697952, -0.00625587860122323, -0.007375003769993782, 0.0030289015267044306, -0.011560995131731033, -0.013013547286391258, 0.011343112215399742, -0.0068269954062998295, -0.0053942506201565266, 0.00884076114743948, -0.006774175446480513, -0.0034795228857547045, 0.006245974451303482, 0.01329745538532734, 0.008312560617923737, 0.005354635883122683, -0.010405556298792362, -0.0059290542267262936, 0.0005348033155314624, -0.012313681654632092, -0.013574761338531971, 0.02251455932855606, 0.02020368166267872, -0.030160266906023026, -0.016479864716529846, 0.0015656201867386699, -0.036683548241853714, 0.027756953611969948, 0.006080911960452795, -0.007302376441657543, -1.9691471607075073e-05, -0.009751907549798489, -0.01960945501923561, -0.000597527192439884, 0.0031312403734773397, -0.006490267347544432, -0.002639353508129716, -0.01884356327354908, -0.016242174431681633, -0.012769254855811596, 0.0015697467606514692, -0.019847145304083824, -0.00035488491994328797, 0.0003740734828170389, -0.02897181548178196, 0.006325204856693745, -0.014050141908228397, -0.004106761422008276, 0.01605730503797531, -0.00955383200198412, -0.023782242089509964, -0.013746426440775394, 0.018038058653473854, -0.010979974642395973, -0.024878257885575294, -0.02007163129746914, -0.009296334348618984, 0.01012825034558773, 0.021444953978061676, 0.023201221600174904, -0.010478183627128601, 0.016083715483546257, 0.0020005605183541775, 0.02477261796593666, 0.02181469462811947, -0.01801164820790291, 0.013370083644986153, -0.03520458564162254, 0.02780977264046669, 0.03710610792040825, 0.02116764709353447, -0.0012990438845008612, 0.00912466924637556, -0.00835877750068903, 0.03961506113409996, -0.002855585655197501, 0.006496869958937168, 0.0037865396589040756, -0.010577221401035786, -0.010887539014220238, -0.015700768679380417, -0.02522158809006214, 0.007731539662927389, -0.009633062407374382, 0.0002552282821852714, -0.0029051045421510935, 0.005955464206635952, -0.0031213366892188787, -0.0012354947393760085, 0.03607611730694771, -0.018724719062447548, 0.016096919775009155, 0.0011290292022749782, -0.01954342983663082, -0.028602074831724167, -0.010227288119494915, -0.0023868074640631676, -0.006051200442016125, 0.008530443534255028, 0.01992637664079666, 0.005730978678911924, -0.014974493533372879, -0.024363262578845024, 0.021141238510608673, 0.02574978955090046, -0.008332367986440659, -0.009923572652041912, -0.0037931420374661684, -0.020797906443476677, -0.009798125363886356, -0.014921672642230988, -0.0348348431289196, -0.05239751935005188, 0.005952163133770227, 0.0005182970780879259, -0.012042978778481483, -0.0015540658496320248, -0.004641564562916756, -0.020348936319351196, 0.012155220843851566, -0.008662492968142033, 0.032352298498153687, -0.005156560335308313, -0.00259643723256886, 0.020692266523838043, -0.02110162191092968, 0.0003453938115853816, -0.004285029135644436, 0.00020488414156716317, 0.00247759185731411, 0.012749447487294674, 0.03567996621131897, -0.014631162397563457, 0.004671276081353426, 0.008715313859283924, 0.00019642467668745667, -0.028364384546875954, -0.02413877658545971, 0.013343673199415207, -0.0010225637815892696, 0.01061023399233818, -0.005988476797938347, -0.004053941462188959, -0.003760129678994417, 0.011785481125116348, -0.008787941187620163, 0.004638263490051031, 0.004067146219313145, -0.017021270468831062, -0.02812669426202774, 0.002581581473350525, -0.014314241707324982, -0.003245133673772216, 0.008827555924654007, -0.03367280215024948, -0.0007630026084370911, -0.021629823371767998, 0.01067625917494297, 0.0009169236291199923, -0.01422180701047182, 0.03488766402006149, -0.014010526239871979, 0.008517238311469555, -0.013812451623380184, -0.01575358957052231, -0.02354455180466175, 0.008081472478806973, 0.00926332175731659, 0.02362378127872944, -0.007196736056357622, 0.007308978587388992, 0.0005570867797359824, -0.003137842984870076, -9.723228140501305e-05, -0.002977732103317976, 0.00590594531968236, -0.029948987066745758, -0.010537606664001942, -0.008464418351650238, 0.003644585609436035, -0.005278707016259432, 0.005024510435760021, -0.0007691924110986292, -0.005975271575152874, -0.018024852499365807, -0.008121087215840816, 0.014591547660529613, 0.002962876344099641, -0.03478202223777771, -0.021075213328003883, -0.021907128393650055, 0.005486685782670975, -0.006074309349060059, -0.005087234079837799, -0.010425363667309284, 0.008807748556137085, 0.014406677335500717, -0.02749285288155079, 0.00601818785071373, -0.041331712156534195, 0.0003245546540711075, -0.0406450517475605, 0.013653990812599659, -0.002310878597199917, -0.020956367254257202, 0.001272633788175881, 0.007619296666234732, 0.011494969949126244, -0.0206526517868042, -0.00045433524064719677, -0.003263290738686919, 0.0007204989087767899, -0.016532685607671738, 0.00650017149746418, 0.002051729941740632, 0.00341019663028419, -0.04302195832133293, 0.0024643868673592806, 0.039377372711896896, 0.024468902498483658, 0.006873213220387697, 0.009012426249682903, -0.003634681925177574, 0.016994861885905266, 0.010768693871796131, 0.015251798555254936, 0.019134074449539185, -0.03058282658457756, -0.006166744511574507, -0.019384970888495445, 0.04391989856958389, -0.00883415900170803, -0.002223395276814699, 0.0005702918278984725, -0.02355775609612465, -0.009586844593286514, 0.009349154308438301, 0.011362920515239239, 0.0011183001333847642, 0.024019932374358177, 0.028734125196933746, -0.019833941012620926, 0.0006470460211858153, -0.005027811508625746, 0.004189292900264263, -0.010002803057432175, -0.03089974820613861, -0.03211461007595062, -0.007375003769993782, -0.022171229124069214, 0.010940358974039555, -0.00787019170820713, -0.0030833722557872534, -0.0075070541352033615, 0.01522538810968399, -0.03787199780344963, -0.01599127985537052, -0.029209505766630173, 0.010134853422641754, 0.042361706495285034, -0.017958827316761017, 0.008523840457201004, 0.02722875215113163, 0.023729421198368073, 0.03245794028043747, -0.011283690109848976, 0.001116649596951902, -0.0017199539579451084, -0.020480986684560776, 0.005846522748470306, 0.006203058175742626, -0.02689862623810768, -0.008688903413712978, 0.004951882641762495, 0.016136534512043, -0.0161233302205801, 0.005622037220746279, -0.021643027663230896, -0.02077149786055088, -0.01428783219307661, -0.0019576442427933216, -0.007586284074932337, 0.005027811508625746, 0.009534024633467197, -0.015265003778040409, -0.0026211964432150126, 0.002177177695557475, 0.012690024450421333, -0.019266124814748764, -0.026145940646529198, 0.01607050932943821, 0.015449874103069305, 0.012769254855811596, 0.0024660376366227865, -0.013436107896268368, -0.0011488368036225438, -0.000422973302192986, 0.03372562304139137, 0.009580242447555065, 0.0013006945373490453, 0.015463079325854778, 0.034623563289642334, -0.005645146127790213, -0.007625899277627468, 0.017338192090392113, -0.0075268615037202835, -0.005628639832139015, -0.006071008276194334, -0.032801270484924316, 0.01358796562999487, -0.010755489580333233, 0.015964869409799576, -0.009170887060463428, 0.004974991548806429, 0.0063978321850299835, -0.027070291340351105, 0.009461397305130959, 0.016294995322823524, 0.01844741404056549, -0.009765112772583961, 0.005232489202171564, -0.023835061118006706, 0.002010464435443282, -0.02606671117246151, -0.007691924460232258, 0.0011678190203383565, -0.021920334547758102, -0.021986359730362892, -0.019847145304083824, 0.008867171593010426, -0.01181189063936472, -0.02103559672832489, -0.017338192090392113, -0.019279329106211662, 0.029658475890755653, 0.21212545037269592, -0.011158241890370846, -0.015251798555254936, 0.020929956808686256, -0.0029760815668851137, 0.015595128759741783, 0.029948987066745758, -0.0070778909139335155, 0.023201221600174904, 0.007909807376563549, 0.0011249026283621788, 0.008167305029928684, 0.006133731920272112, -0.0034564142115414143, 0.014314241707324982, -0.0174174215644598, -0.017906008288264275, -0.026238376274704933, -0.0006136207957752049, -0.012175029143691063, -0.009844343177974224, 0.0033326169941574335, -0.0006127954693511128, -0.020230092108249664, 0.016440249979496002, 0.012855087406933308, -0.019662275910377502, -0.00961985718458891, 0.0206526517868042, 0.021048802882432938, -0.007975832559168339, -0.020375346764922142, 0.004816531203687191, -0.002962876344099641, 0.015159363858401775, -0.0059290542267262936, -0.01038574893027544, -0.024878257885575294, 0.010894142091274261, 0.0011587404878810048, 0.009883957915008068, 0.014340652152895927, -0.02083752304315567, -0.00471089081838727, -0.0008979414124041796, 0.01010184083133936, -0.001060528215020895, 0.022408919408917427, -0.014393472112715244, -0.0008591516525484622, -0.03343511000275612, -0.018539847806096077, 0.013521941378712654, 0.03665713593363762, -0.0013906536623835564, 0.01760229282081127, -0.003056962275877595, 0.001748014590702951, -0.025591328740119934, -0.022250458598136902, 0.004737301263958216, 0.021392133086919785, -0.01038574893027544, 0.0009953284170478582, -0.04104120284318924, 0.012505154125392437, 0.0022399015724658966, -0.008517238311469555, 0.010656451806426048, -0.029051044955849648, 0.01890958845615387, -0.012762651778757572, -0.00948780681937933, -0.007427824195474386, 0.0051037403754889965, -0.02839079312980175, -0.0007374178385362029, 0.01090074423700571, -0.0035125354770570993, 0.015185773372650146, -0.005572518799453974, 0.016757171601057053, 0.024785824120044708, 0.01364078652113676, -0.013786041177809238, -0.024666978046298027, 0.006259179674088955, 0.016096919775009155, -0.012478744611144066, -0.009203899651765823, -0.00884076114743948, -0.028628483414649963, 0.00392189109697938, 0.01103939674794674, 0.02201276831328869, 0.017509857192635536, 0.00037304183933883905, 0.018236132338643074, -0.0009169236291199923, -0.00396810844540596, -0.03396331146359444, -0.02213161438703537, 0.04302195832133293, -0.015040518715977669, -0.03071487694978714, -0.017338192090392113, 0.016664735972881317, 0.02085072733461857, 0.00913127139210701, -0.0033903890289366245, -0.014974493533372879, -0.027519263327121735, 0.0002707029052544385, 0.002320782281458378, 0.008226728066802025, 0.03639303520321846, 0.0008855616906657815, -0.024231212213635445, -0.00787019170820713, 0.010299916379153728, 0.02090354822576046, -0.029975395649671555, 0.0028935500886291265, -0.005800305400043726, 0.0013452614657580853, -0.006371422205120325, 0.004592045675963163, 0.005001401528716087, 0.007956025190651417, -0.026159144937992096, 0.01786639355123043, -0.01181189063936472, -0.0006664408720098436, -0.013337071053683758, -0.006602510344237089, 0.002731788670644164, 0.01412937231361866, 0.01061683613806963, 0.00016898299509193748, 0.006137033458799124, 0.007949422113597393, -0.017391011118888855, -0.013918091543018818, 0.013508736155927181, 0.004364259075373411, -0.016598710790276527, 0.012260861694812775, -0.007269363850355148, -0.008741723373532295, -0.022673020139336586, -0.022369304671883583, -0.009058644063770771, 0.011864710599184036, -0.027519263327121735, 0.018368182703852654, -0.038822758942842484, -0.024680182337760925, -0.023174811154603958, -0.0014830888248980045, 0.009085054509341717, -0.04331246763467789, 0.002966177649796009, 0.024429287761449814, -0.011917530559003353, -0.01457834243774414, -0.0014525522710755467, -0.169024258852005, 0.035970475524663925, 0.0098377401009202, -0.01671755500137806, 0.02799464389681816, -0.02005842514336109, 0.02523479424417019, 0.014763212762773037, -0.02947360649704933, 0.00021272462618071586, 0.02070547267794609, -0.0016877666348591447, -0.03396331146359444, -0.01455193292349577, 0.009434986859560013, 0.01600448414683342, -0.0005645146011374891, 0.01728537119925022, 0.003103179857134819, -0.0046646734699606895, 0.009144476614892483, -0.007969229482114315, 0.0148424431681633, -0.012954125180840492, 0.0037535270676016808, 0.009474602527916431, 0.037898410111665726, 0.015529103577136993, 0.004836338572204113, 0.0015829518670216203, -0.013178610242903233, -0.022540969774127007, 0.002220093971118331, 0.03670995682477951, 0.025829019024968147, 0.019781120121479034, -0.0006841851281933486, 0.0062129623256623745, 0.002560123335570097, 0.02283148095011711, 0.0027796567883342505, 0.012716434895992279, 0.013211622834205627, -0.00045103399315848947, 0.001998909981921315, 0.04046018421649933, -0.001949391094967723, 0.008966208435595036, 0.014802827499806881, -0.001794232171960175, 0.01393129676580429, -0.03375203162431717, 0.010715873911976814, -0.00842480268329382, 0.035389453172683716, 0.01949061080813408, -0.012498551979660988, 0.004592045675963163, 0.02606671117246151, 0.0023158304393291473, -0.014882057905197144, -0.005849823821336031, 0.0070976982824504375, 0.0004332897369749844, -0.019068049266934395, -0.019979195669293404, -0.021392133086919785, 0.007559874095022678, -0.029024634510278702, 0.00023253215476870537, -0.019965991377830505, 0.002333987271413207, -0.0068071880377829075, -0.018737923353910446, 0.015978075563907623, 0.00519287446513772, -0.029975395649671555, 0.016611915081739426, 0.0029364663641899824, -0.021973153576254845, -0.0062426733784377575, 0.01683640107512474, -0.0038756735157221556, -0.020995981991291046, 0.008015447296202183, -0.015978075563907623, -0.010022610425949097, -0.010478183627128601, -0.010999782010912895, -0.03478202223777771, 0.0053975521586835384, -0.04690423235297203, -0.003710610792040825, -0.01766831800341606, -0.0005810208967886865, 0.015647949650883675, 0.016176149249076843, 0.00664872769266367, 0.0077909622341394424, -0.017206141725182533, -0.0018206421518698335, -0.008702108636498451, -0.013376685790717602, 0.014446292072534561, 0.024310441687703133, 0.02226366475224495, 0.04098838195204735, 0.020745087414979935, -0.009243514388799667, -0.017496652901172638, -0.012069388292729855, 0.035706374794244766, 0.023636987432837486, 0.028602074831724167, -0.008365380577743053, 0.00926332175731659, 0.0005934006185270846, -0.01826254278421402, 0.0254856888204813, -0.0009177488973364234, 0.062169235199689865, 0.020282911136746407, -0.021841103211045265, -0.0037073094863444567, -0.005420661065727472, -0.003195615019649267, -0.10225968062877655, -0.0062327696941792965, -0.0024214705917984247, 0.021260082721710205, -0.018024852499365807, 0.03966788202524185, 0.005565916188061237, 0.04143735393881798, -0.01441988255828619, 0.03729097917675972, 0.010464978404343128, -0.026357220485806465, -0.007368401624262333, -0.014763212762773037, 0.006037995684891939, -0.010927154682576656, -0.023584166541695595, 0.0033507738262414932, -0.01535743847489357, 0.025657353922724724, -0.008946401067078114, 0.0033260146155953407, 0.0019328849157318473, -0.00864268559962511, 0.014631162397563457, -0.008008845150470734, -0.010141455568373203, 0.0029843347147107124, 0.007117506116628647, 0.02186751365661621, 0.0033458219841122627, -0.005443769507110119, 0.0309789776802063, -0.014657572843134403, 0.004430284257978201, 0.012637204490602016, 0.0019592950120568275, -0.025657353922724724, 0.021458158269524574, -0.05308418348431587, -0.0036842008121311665, -0.009005824103951454, 0.016942040994763374, -0.024112368002533913, -0.005288610700517893, 0.002819271758198738, -0.026053505018353462, 0.009368961676955223, 0.042282477021217346, -0.0183813888579607, -0.025393255054950714, -0.008847363293170929, -0.02786259353160858, -0.00424211286008358, 0.03206178918480873, 0.0219467431306839, 0.015832819044589996, 0.017470242455601692, -0.004397271666675806, 0.01555551402270794, -0.00412987032905221, -0.015595128759741783, -0.004024229943752289, 0.035389453172683716, 0.00234719249419868, -0.006308698561042547, 0.006615715101361275, 0.001092715421691537, 0.022818274796009064, -0.01245233416557312, -0.005285309627652168, 0.003147746669128537, -0.01605730503797531, -0.007434426341205835, -0.023769035935401917, -0.0007126584532670677, 0.0010365941561758518, -0.019332149997353554, 0.033012550324201584, -0.02573658525943756, -0.0011381077347323298, -0.01864548958837986, 0.007804166991263628, 0.004568937234580517, 0.025921454653143883, 0.004846242722123861, 0.008721916005015373, 0.029024634510278702, -0.006143635604530573, -0.009936777874827385, 0.004182690288871527, 0.019688686355948448, -0.002056682016700506, -0.041516583412885666, -0.01323143020272255, -0.022739045321941376, -0.010702668689191341, -0.0016968451673164964, 0.022144818678498268, 0.011290292255580425, -0.007441028952598572, -0.014882057905197144, -0.060003612190485, 0.025921454653143883, 0.009137874469161034, 0.020111246034502983, 0.004974991548806429, 0.0006086688954383135, 0.01054420880973339, -0.015172568149864674, 0.008880375884473324, 0.014683982357382774, -0.0069524431601166725, 0.025564920157194138, 0.002038524951785803, -0.014036936685442924, -0.013720015995204449, -0.0018751128809526563, 0.015780000016093254, 0.0002700839249882847, 0.008814350701868534, 0.02103559672832489, -0.006411037407815456, -0.00706468615680933, 0.010405556298792362, 0.0008022050024010241, 0.0196754802018404, 0.0017975333612412214, -0.0069326357915997505, 0.018407799303531647, -0.017826776951551437, -0.004456694237887859, 0.009283129125833511, -0.025921454653143883, 0.019054844975471497, 0.00932274479418993, 0.010339531116187572, -0.03026590682566166, -0.004195895045995712, 0.0008438833174295723, 0.006939238402992487, 0.012709831818938255, -0.02012445032596588, -0.015595128759741783, 0.012313681654632092, -0.010795104317367077, -0.012425924651324749, 0.01061683613806963, -0.010847924277186394, -0.017021270468831062, 0.01493487786501646, -0.00897281151264906, 0.00367759820073843, 0.007196736056357622, -0.0015961568569764495, -0.018658693879842758, -0.0354950949549675, -0.00462835980579257, 0.03156000003218651, 0.001817340962588787, -0.009012426249682903, -0.02374262735247612, 0.01683640107512474, 0.024310441687703133, -0.002338939346373081, -0.002718583680689335, 0.009784920141100883, -0.0038657698314636946, 0.001658055349253118, -0.009104861877858639, 0.0065331836231052876, -0.022620199248194695, -0.01748344674706459, 0.0007786835194565356, -0.014142576605081558, 0.03116384893655777, -0.002660811645910144, 0.016493070870637894, 0.024997103959321976, 0.011554392985999584, -0.026119530200958252, 0.0016374224796891212, 0.004707589745521545, -0.01580640859901905, -0.016876015812158585, 0.015634743496775627, 0.03348793089389801, 0.022857889533042908, 0.0001055370012181811, 0.015529103577136993, 0.01116484496742487, 0.030952567234635353, 0.010735681280493736, 0.016757171601057053, -0.008008845150470734, -0.0020830919966101646, 0.021920334547758102, 0.013944501988589764, 0.00016898299509193748, -0.020362140610814095, 0.007368401624262333, 0.014155781827867031, -0.029077455401420593, -0.007823974825441837, 0.00325008574873209, -0.012346694245934486, -0.007956025190651417, 0.01716652698814869, -0.029051044955849648, -0.01684960536658764, -0.012531564570963383, 0.014683982357382774, 0.03472920507192612, 0.003463016590103507, -0.0005195350386202335, 0.018104083836078644, -0.015449874103069305, 0.028734125196933746, -0.010913949459791183, -0.04283708706498146, -0.02362378127872944, 0.009038836695253849, 0.020335732027888298, -0.003991217352449894, 0.007883396930992603, -0.018077673390507698, -0.0022828178480267525, 0.017628701403737068, 0.003859167220070958, -0.03372562304139137, -0.015383848920464516, -0.019332149997353554, 0.009368961676955223, -0.034676384180784225, -0.01929253526031971, 0.0003090800018981099, -0.03766071796417236, -0.00023273848637472838, -0.031190257519483566, 0.026013890281319618, -0.03182410076260567, 0.028417203575372696, 0.0032616399694234133, 0.006698246579617262, 0.009408577345311642, -0.010854526422917843, 0.00019075065210927278, -0.0025667259469628334, 0.00919069442898035, -0.02981693670153618, -0.0066619329154491425, -0.0008022050024010241, -0.0034134977031499147, 0.013178610242903233, 0.002495748922228813, 0.005622037220746279, 0.009659472852945328, -0.014168987050652504, -0.00938876997679472, -0.011356317438185215, -0.02438967302441597, -0.01922651007771492, 0.02186751365661621, 0.011224267072975636, -0.0023290354292839766, 0.006754368077963591, -0.014261421747505665, 0.014314241707324982, 0.007170326076447964, 0.0014055093051865697, -0.03898122161626816, -0.009514217264950275, -0.007011865731328726, -0.008101279847323895, -0.028602074831724167, 0.028047462925314903, -6.736623618053272e-05, -0.006899623200297356, 0.004030832555145025, 0.006077610421925783, 0.002292721765115857, -0.017113706097006798, -0.005116945598274469, -0.005899342708289623, -0.010531003586947918, 0.03343511000275612, -0.005215982906520367, -0.028100283816456795, -0.00941517949104309, -0.005143355578184128]\n",
      "\n",
      "            CALL db.index.vector.queryNodes('moviePlotsEmbedding', $k, $plot_embedding) YIELD node, score\n",
      "            WITH node RETURN node {.title, .plot, .year, .rating} AS node\n",
      "        \n",
      "Response from tools: ['{\"movie\": {\"title\": \"Casino\", \"year\": 1995, \"rating\": null, \"plot\": \"Greed, deception, money, power, and murder occur between two mobster best friends and a trophy wife over a gambling empire.\"}}']\n",
      "Routing question: What year was the movie about 'two mobster best friends and a trophy wife' released?\n",
      "Output: [{'question': \"What movie is about 'two mobster best friends and a trophy wife'?\", 'answers': ['{\"movie\": {\"title\": \"Casino\", \"year\": 1995, \"rating\": null, \"plot\": \"Greed, deception, money, power, and murder occur between two mobster best friends and a trophy wife over a gambling empire.\"}}']}]\n",
      "Updated question: What year was the movie 'Casino' released?\n",
      "MovieRetriever invoked: 'Casino' 'exact'\n",
      "MovieRetriever invoked: 'Casino' 'contains'\n",
      "Response from tools: ['[{\"movie\": {\"title\": \"Casino\", \"year\": 1995, \"plot\": \"Greed, deception, money, power, and murder occur between two mobster best friends and a trophy wife over a gambling empire.\"}, \"actors\": [{\"name\": \"Robert De Niro\", \"role\": \"Sam \\'Ace\\' Rothstein\"}, {\"name\": \"Joe Pesci\", \"role\": \"Nicky Santoro\"}, {\"name\": \"Sharon Stone\", \"role\": \"Ginger McKenna\"}, {\"name\": \"James Woods\", \"role\": \"Lester Diamond\"}]}]', '[{\"movie\": {\"title\": \"Casino\", \"year\": 1995, \"plot\": \"Greed, deception, money, power, and murder occur between two mobster best friends and a trophy wife over a gambling empire.\"}, \"actors\": [{\"name\": \"Robert De Niro\", \"role\": \"Sam \\'Ace\\' Rothstein\"}, {\"name\": \"Joe Pesci\", \"role\": \"Nicky Santoro\"}, {\"name\": \"Sharon Stone\", \"role\": \"Ginger McKenna\"}, {\"name\": \"James Woods\", \"role\": \"Lester Diamond\"}]}]']\n",
      "Routing question: Who were some actors playing roles in the movie about 'two mobster best friends and a trophy wife'?\n",
      "Output: [{'question': \"What movie is about 'two mobster best friends and a trophy wife'?\", 'answers': ['{\"movie\": {\"title\": \"Casino\", \"year\": 1995, \"rating\": null, \"plot\": \"Greed, deception, money, power, and murder occur between two mobster best friends and a trophy wife over a gambling empire.\"}}']}, {'question': \"What year was the movie about 'two mobster best friends and a trophy wife' released?\", 'answers': ['[{\"movie\": {\"title\": \"Casino\", \"year\": 1995, \"plot\": \"Greed, deception, money, power, and murder occur between two mobster best friends and a trophy wife over a gambling empire.\"}, \"actors\": [{\"name\": \"Robert De Niro\", \"role\": \"Sam \\'Ace\\' Rothstein\"}, {\"name\": \"Joe Pesci\", \"role\": \"Nicky Santoro\"}, {\"name\": \"Sharon Stone\", \"role\": \"Ginger McKenna\"}, {\"name\": \"James Woods\", \"role\": \"Lester Diamond\"}]}]', '[{\"movie\": {\"title\": \"Casino\", \"year\": 1995, \"plot\": \"Greed, deception, money, power, and murder occur between two mobster best friends and a trophy wife over a gambling empire.\"}, \"actors\": [{\"name\": \"Robert De Niro\", \"role\": \"Sam \\'Ace\\' Rothstein\"}, {\"name\": \"Joe Pesci\", \"role\": \"Nicky Santoro\"}, {\"name\": \"Sharon Stone\", \"role\": \"Ginger McKenna\"}, {\"name\": \"James Woods\", \"role\": \"Lester Diamond\"}]}]']}]\n",
      "Updated question: Who were some actors playing roles in the movie 'Casino'?\n",
      "MovieRetriever invoked: 'Casino' 'exact'\n",
      "Response from tools: ['[{\"movie\": {\"title\": \"Casino\", \"year\": 1995, \"plot\": \"Greed, deception, money, power, and murder occur between two mobster best friends and a trophy wife over a gambling empire.\"}, \"actors\": [{\"name\": \"Robert De Niro\", \"role\": \"Sam \\'Ace\\' Rothstein\"}, {\"name\": \"Joe Pesci\", \"role\": \"Nicky Santoro\"}, {\"name\": \"Sharon Stone\", \"role\": \"Ginger McKenna\"}, {\"name\": \"James Woods\", \"role\": \"Lester Diamond\"}]}]']\n",
      "Unanswered questions: []\n",
      "--- output ---\n",
      "The movie about \"two mobster best friends and a trophy wife\" is called \"Casino.\" It was released in 1995. Some actors playing roles in the movie are Robert De Niro as Sam 'Ace' Rothstein, Joe Pesci as Nicky Santoro, Sharon Stone as Ginger McKenna, and James Woods as Lester Diamond.\n",
      "------ Single retriever ------\n",
      "Text2Cypher invoked: What movie is about \"two mobster best friends and a trophy wife\", and what year was it released? And who were some actors playing roles in it?\n",
      "MATCH (m:Movie)-[:ACTED_IN]-(a:Actor) \n",
      "WHERE m.plot CONTAINS \"two mobster best friends and a trophy wife\" \n",
      "RETURN m.title AS Movie, m.year AS Year, COLLECT(a.name) AS Actors\n",
      "[<Record Movie='Casino' Year=1995 Actors=['Robert De Niro', 'Joe Pesci', 'Sharon Stone', 'James Woods']>]\n",
      "--- output ---\n",
      "The movie that is about \"two mobster best friends and a trophy wife\" is \"Casino\", released in 1995. Some actors who played roles in the movie are Robert De Niro, Joe Pesci, Sharon Stone, and James Woods.\n"
     ]
    }
   ],
   "source": [
    "print(\"------ Agentic retriever ------\")\n",
    "response = rag_app.handle_input('What movie is about \"two mobster best friends and a trophy wife\", and what year was it released? And who were some actors playing roles in it?')\n",
    "print(\"--- output ---\")\n",
    "print(response)\n",
    "\n",
    "print(\"------ Single retriever ------\")\n",
    "response = single_retriever_rag_app.handle_input('What movie is about \"two mobster best friends and a trophy wife\", and what year was it released? And who were some actors playing roles in it?')\n",
    "print(\"--- output ---\")\n",
    "print(response)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "------ Agentic retriever ------\n",
      "Expanded questions: [\"How many actors were in the movie 'Casino'?\"]\n",
      "Updated question: How many actors were in the movie 'Casino'?\n",
      "MovieRetriever invoked: 'Casino' 'exact'\n",
      "Response from tools: ['[{\"movie\": {\"title\": \"Casino\", \"year\": 1995, \"plot\": \"Greed, deception, money, power, and murder occur between two mobster best friends and a trophy wife over a gambling empire.\"}, \"actors\": [{\"name\": \"Robert De Niro\", \"role\": \"Sam \\'Ace\\' Rothstein\"}, {\"name\": \"Joe Pesci\", \"role\": \"Nicky Santoro\"}, {\"name\": \"Sharon Stone\", \"role\": \"Ginger McKenna\"}, {\"name\": \"James Woods\", \"role\": \"Lester Diamond\"}]}]']\n",
      "Unanswered questions: []\n",
      "--- output ---\n",
      "The movie \"Casino\" had 4 actors.\n",
      "------ Single retriever ------\n",
      "Text2Cypher invoked: How many actors were in the movie \"Casino\"\n",
      "MATCH (m:Movie {title: \"Casino\"})<-[:ACTED_IN]-(a:Actor)\n",
      "RETURN COUNT(DISTINCT a)\n",
      "[<Record COUNT(DISTINCT a)=4>]\n",
      "--- output ---\n",
      "Based on the provided information, there were 4 actors in the movie \"Casino.\"\n"
     ]
    }
   ],
   "source": [
    "print(\"------ Agentic retriever ------\")\n",
    "response = rag_app.handle_input('How many actors were in the movie \"Casino\"')\n",
    "print(\"--- output ---\")\n",
    "print(response)\n",
    "\n",
    "print(\"------ Single retriever ------\")\n",
    "response = single_retriever_rag_app.handle_input('How many actors were in the movie \"Casino\"')\n",
    "print(\"--- output ---\")\n",
    "print(response)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "------ Agentic retriever ------\n",
      "Expanded questions: ['What are the two highest rated movies Robert De Niro has acted in?', 'What is the plot in the first highest rated movie Robert De Niro has acted in?', 'What is the plot in the second highest rated movie Robert De Niro has acted in?']\n",
      "Updated question: What are the two highest rated movies in which Robert De Niro has acted?\n",
      "Text2Cypher invoked: What are the two highest rated movies in which Robert De Niro has acted?\n",
      "MATCH (a:Actor {name: 'Robert De Niro'})-[:ACTED_IN]->(m:Movie)<-[r:RATED]-(:User)\n",
      "RETURN m.title, AVG(r.rating) as AvgRating \n",
      "ORDER BY AvgRating DESC\n",
      "LIMIT 2\n",
      "[<Record m.title='Hide and Seek' AvgRating=4.5>, <Record m.title='Godfather: Part II, The' AvgRating=4.385185185185186>]\n",
      "Response from tools: ['{\"query\": \"MATCH (a:Actor {name: \\'Robert De Niro\\'})-[:ACTED_IN]->(m:Movie)<-[r:RATED]-(:User)\\\\nRETURN m.title, AVG(r.rating) as AvgRating \\\\nORDER BY AvgRating DESC\\\\nLIMIT 2\", \"records\": [{\"m.title\": \"Hide and Seek\", \"AvgRating\": 4.5}, {\"m.title\": \"Godfather: Part II, The\", \"AvgRating\": 4.385185185185186}]}']\n",
      "Updated question: What is the plot of the highest rated movie Robert De Niro has acted in?\n",
      "MovieRetriever invoked: 'Hide and Seek' 'exact'\n",
      "Response from tools: ['[{\"movie\": {\"title\": \"Hide and Seek\", \"year\": 2005, \"plot\": \"As a widower tries to piece together his life in the wake of his wife\\'s suicide, his daughter finds solace -- at first -- in her imaginary friend.\"}, \"actors\": [{\"name\": \"Dakota Fanning\", \"role\": \"Emily Callaway\"}, {\"name\": \"Robert De Niro\", \"role\": \"David Callaway\"}, {\"name\": \"Famke Janssen\", \"role\": \"Katherine\"}, {\"name\": \"Elisabeth Shue\", \"role\": \"Elizabeth\"}]}]']\n",
      "Updated question: What is the plot in the second highest rated movie Robert De Niro has acted in?\n",
      "MovieRetriever invoked: 'Godfather: Part II' 'exact'\n",
      "Response from tools: ['No plot found for the movie']\n",
      "Unanswered questions: ['What are the plots in the second highest rated movie Robert De Niro has acted in?']\n",
      "Updated question: What is the plot in the second highest rated movie Robert De Niro has acted in?\n",
      "Text2Cypher invoked: What is the plot in the second highest rated movie Robert De Niro has acted in?\n",
      "MATCH (a:Actor {name: \"Robert De Niro\"})-[:ACTED_IN]->(m:Movie)<-[r:RATED]- (:User)\n",
      "RETURN m.plot AS Plot\n",
      "ORDER BY r.rating DESC\n",
      "SKIP 1\n",
      "LIMIT 1\n",
      "[<Record Plot='Shortly before an election, a spin-doctor and a Hollywood producer join efforts to fabricate a war in order to cover up a presidential sex scandal.'>]\n",
      "Response from tools: ['{\"query\": \"MATCH (a:Actor {name: \\\\\"Robert De Niro\\\\\"})-[:ACTED_IN]->(m:Movie)<-[r:RATED]- (:User)\\\\nRETURN m.plot AS Plot\\\\nORDER BY r.rating DESC\\\\nSKIP 1\\\\nLIMIT 1\", \"records\": [{\"Plot\": \"Shortly before an election, a spin-doctor and a Hollywood producer join efforts to fabricate a war in order to cover up a presidential sex scandal.\"}]}']\n",
      "--- output ---\n",
      "The two highest rated movies that Robert De Niro has acted in are \"Hide and Seek\" and \"Godfather: Part II, The\". \n",
      "\n",
      "The plot of \"Hide and Seek\" is: \"As a widower tries to piece together his life in the wake of his wife's suicide, his daughter finds solace -- at first -- in her imaginary friend.\"\n",
      "\n",
      "Unfortunately, I do not have the plot for \"Godfather: Part II, The\" in the information provided.\n",
      "------ Single retriever ------\n",
      "Text2Cypher invoked: What are two the highest rated movies Robert De Niro has acted in? What are the plots in those movies?\n",
      "MATCH (a:Actor {name:\"Robert De Niro\"})-[:ACTED_IN]->(m:Movie)\n",
      "RETURN m.title AS Movie, m.imdbRating AS Rating, m.plot AS Plot\n",
      "ORDER BY Rating DESC\n",
      "LIMIT 2\n",
      "[<Record Movie='Godfather: Part II, The' Rating=9.0 Plot='The early life and career of Vito Corleone in 1920s New York is portrayed while his son, Michael, expands and tightens his grip on his crime syndicate stretching from Lake Tahoe, Nevada to pre-revolution 1958 Cuba.'>, <Record Movie='Goodfellas' Rating=8.7 Plot='Henry Hill and his friends work their way up through the mob hierarchy.'>]\n",
      "--- output ---\n",
      "Two of the highest rated movies Robert De Niro has acted in are \"Godfather: Part II, The\" with a rating of 9.0 and \"Goodfellas\" with a rating of 8.7. \n",
      "\n",
      "The plot of \"Godfather: Part II, The\" is: The early life and career of Vito Corleone in 1920s New York is portrayed while his son, Michael, expands and tightens his grip on his crime syndicate stretching from Lake Tahoe, Nevada to pre-revolution 1958 Cuba.\n",
      "\n",
      "The plot of \"Goodfellas\" is: Henry Hill and his friends work their way up through the mob hierarchy.\n"
     ]
    }
   ],
   "source": [
    "print(\"------ Agentic retriever ------\")\n",
    "response = rag_app.handle_input('What are two the highest rated movies Robert De Niro has acted in? What are the plots in those movies?')\n",
    "print(\"--- output ---\")\n",
    "print(response)\n",
    "\n",
    "print(\"------ Single retriever ------\")\n",
    "response = single_retriever_rag_app.handle_input('What are two the highest rated movies Robert De Niro has acted in? What are the plots in those movies?')\n",
    "print(\"--- output ---\")\n",
    "print(response)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
